OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16lf1778.c
__at(0x0914) __sfr CM6CON0;
__at(0x0914) volatile __CM6CON0bits_t CM6CON0bits;

__at(0x0915) __sfr CM6CON1;
__at(0x0915) volatile __CM6CON1bits_t CM6CON1bits;

__at(0x0916) __sfr CM6NSEL;
__at(0x0916) volatile __CM6NSELbits_t CM6NSELbits;

__at(0x0917) __sfr CM6PSEL;
__at(0x0917) volatile __CM6PSELbits_t CM6PSELbits;

__at(0x0D8E) __sfr PWMEN;
__at(0x0D8E) volatile __PWMENbits_t PWMENbits;

__at(0x0D8F) __sfr PWMLD;
__at(0x0D8F) volatile __PWMLDbits_t PWMLDbits;

__at(0x0D90) __sfr PWMOUT;
__at(0x0D90) volatile __PWMOUTbits_t PWMOUTbits;

__at(0x0D91) __sfr PWM5PH;

__at(0x0D91) __sfr PWM5PHL;
__at(0x0D91) volatile __PWM5PHLbits_t PWM5PHLbits;

__at(0x0D92) __sfr PWM5PHH;
__at(0x0D92) volatile __PWM5PHHbits_t PWM5PHHbits;

__at(0x0D93) __sfr PWM5DC;

__at(0x0D93) __sfr PWM5DCL;
__at(0x0D93) volatile __PWM5DCLbits_t PWM5DCLbits;

__at(0x0D94) __sfr PWM5DCH;
__at(0x0D94) volatile __PWM5DCHbits_t PWM5DCHbits;

__at(0x0D95) __sfr PWM5PR;

__at(0x0D95) __sfr PWM5PRL;
__at(0x0D95) volatile __PWM5PRLbits_t PWM5PRLbits;

__at(0x0D96) __sfr PWM5PRH;
__at(0x0D96) volatile __PWM5PRHbits_t PWM5PRHbits;

__at(0x0D97) __sfr PWM5OF;

__at(0x0D97) __sfr PWM5OFL;
__at(0x0D97) volatile __PWM5OFLbits_t PWM5OFLbits;

__at(0x0D98) __sfr PWM5OFH;
__at(0x0D98) volatile __PWM5OFHbits_t PWM5OFHbits;

__at(0x0D99) __sfr PWM5TMR;

__at(0x0D99) __sfr PWM5TMRL;
__at(0x0D99) volatile __PWM5TMRLbits_t PWM5TMRLbits;

__at(0x0D9A) __sfr PWM5TMRH;
__at(0x0D9A) volatile __PWM5TMRHbits_t PWM5TMRHbits;

__at(0x0D9B) __sfr PWM5CON;
__at(0x0D9B) volatile __PWM5CONbits_t PWM5CONbits;

__at(0x0D9C) __sfr PWM5INTCON;
__at(0x0D9C) volatile __PWM5INTCONbits_t PWM5INTCONbits;

__at(0x0D9C) __sfr PWM5INTE;
__at(0x0D9C) volatile __PWM5INTEbits_t PWM5INTEbits;

__at(0x0D9D) __sfr PWM5INTF;
__at(0x0D9D) volatile __PWM5INTFbits_t PWM5INTFbits;

__at(0x0D9D) __sfr PWM5INTFLG;
__at(0x0D9D) volatile __PWM5INTFLGbits_t PWM5INTFLGbits;

__at(0x0D9E) __sfr PWM5CLKCON;
__at(0x0D9E) volatile __PWM5CLKCONbits_t PWM5CLKCONbits;

__at(0x0D9F) __sfr PWM5LDCON;
__at(0x0D9F) volatile __PWM5LDCONbits_t PWM5LDCONbits;

__at(0x0DA0) __sfr PWM5OFCON;
__at(0x0DA0) volatile __PWM5OFCONbits_t PWM5OFCONbits;

__at(0x0DA1) __sfr PWM6PH;

__at(0x0DA1) __sfr PWM6PHL;
__at(0x0DA1) volatile __PWM6PHLbits_t PWM6PHLbits;

__at(0x0DA2) __sfr PWM6PHH;
__at(0x0DA2) volatile __PWM6PHHbits_t PWM6PHHbits;

__at(0x0DA3) __sfr PWM6DC;

__at(0x0DA3) __sfr PWM6DCL;
__at(0x0DA3) volatile __PWM6DCLbits_t PWM6DCLbits;

__at(0x0DA4) __sfr PWM6DCH;
__at(0x0DA4) volatile __PWM6DCHbits_t PWM6DCHbits;

__at(0x0DA5) __sfr PWM6PR;

__at(0x0DA5) __sfr PWM6PRL;
__at(0x0DA5) volatile __PWM6PRLbits_t PWM6PRLbits;

__at(0x0DA6) __sfr PWM6PRH;
__at(0x0DA6) volatile __PWM6PRHbits_t PWM6PRHbits;

__at(0x0DA7) __sfr PWM6OF;

__at(0x0DA7) __sfr PWM6OFL;
__at(0x0DA7) volatile __PWM6OFLbits_t PWM6OFLbits;

__at(0x0DA8) __sfr PWM6OFH;
__at(0x0DA8) volatile __PWM6OFHbits_t PWM6OFHbits;

__at(0x0DA9) __sfr PWM6TMR;

__at(0x0DA9) __sfr PWM6TMRL;
__at(0x0DA9) volatile __PWM6TMRLbits_t PWM6TMRLbits;

__at(0x0DAA) __sfr PWM6TMRH;
__at(0x0DAA) volatile __PWM6TMRHbits_t PWM6TMRHbits;

__at(0x0DAB) __sfr PWM6CON;
__at(0x0DAB) volatile __PWM6CONbits_t PWM6CONbits;

__at(0x0DAC) __sfr PWM6INTCON;
__at(0x0DAC) volatile __PWM6INTCONbits_t PWM6INTCONbits;

__at(0x0DAC) __sfr PWM6INTE;
__at(0x0DAC) volatile __PWM6INTEbits_t PWM6INTEbits;

__at(0x0DAD) __sfr PWM6INTF;
__at(0x0DAD) volatile __PWM6INTFbits_t PWM6INTFbits;

__at(0x0DAD) __sfr PWM6INTFLG;
__at(0x0DAD) volatile __PWM6INTFLGbits_t PWM6INTFLGbits;

__at(0x0DAE) __sfr PWM6CLKCON;
__at(0x0DAE) volatile __PWM6CLKCONbits_t PWM6CLKCONbits;

__at(0x0DAF) __sfr PWM6LDCON;
__at(0x0DAF) volatile __PWM6LDCONbits_t PWM6LDCONbits;

__at(0x0DB0) __sfr PWM6OFCON;
__at(0x0DB0) volatile __PWM6OFCONbits_t PWM6OFCONbits;

__at(0x0DB1) __sfr PWM11PH;

__at(0x0DB1) __sfr PWM11PHL;
__at(0x0DB1) volatile __PWM11PHLbits_t PWM11PHLbits;

__at(0x0DB2) __sfr PWM11PHH;
__at(0x0DB2) volatile __PWM11PHHbits_t PWM11PHHbits;

__at(0x0DB3) __sfr PWM11DC;

__at(0x0DB3) __sfr PWM11DCL;
__at(0x0DB3) volatile __PWM11DCLbits_t PWM11DCLbits;

__at(0x0DB4) __sfr PWM11DCH;
__at(0x0DB4) volatile __PWM11DCHbits_t PWM11DCHbits;

__at(0x0DB5) __sfr PWM11PR;

__at(0x0DB5) __sfr PWM11PRL;
__at(0x0DB5) volatile __PWM11PRLbits_t PWM11PRLbits;

__at(0x0DB6) __sfr PWM11PRH;
__at(0x0DB6) volatile __PWM11PRHbits_t PWM11PRHbits;

__at(0x0DB7) __sfr PWM11OF;

__at(0x0DB7) __sfr PWM11OFL;
__at(0x0DB7) volatile __PWM11OFLbits_t PWM11OFLbits;

__at(0x0DB8) __sfr PWM11OFH;
__at(0x0DB8) volatile __PWM11OFHbits_t PWM11OFHbits;

__at(0x0DB9) __sfr PWM11TMR;

__at(0x0DB9) __sfr PWM11TMRL;
__at(0x0DB9) volatile __PWM11TMRLbits_t PWM11TMRLbits;

__at(0x0DBA) __sfr PWM11TMRH;
__at(0x0DBA) volatile __PWM11TMRHbits_t PWM11TMRHbits;

__at(0x0DBB) __sfr PWM11CON;
__at(0x0DBB) volatile __PWM11CONbits_t PWM11CONbits;

__at(0x0DBC) __sfr PWM11INTCON;
__at(0x0DBC) volatile __PWM11INTCONbits_t PWM11INTCONbits;

__at(0x0DBC) __sfr PWM11INTE;
__at(0x0DBC) volatile __PWM11INTEbits_t PWM11INTEbits;

__at(0x0DBD) __sfr PWM11INTF;
__at(0x0DBD) volatile __PWM11INTFbits_t PWM11INTFbits;

__at(0x0DBD) __sfr PWM11INTFLG;
__at(0x0DBD) volatile __PWM11INTFLGbits_t PWM11INTFLGbits;

__at(0x0DBE) __sfr PWM11CLKCON;
__at(0x0DBE) volatile __PWM11CLKCONbits_t PWM11CLKCONbits;

__at(0x0DBF) __sfr PWM11LDCON;
__at(0x0DBF) volatile __PWM11LDCONbits_t PWM11LDCONbits;

__at(0x0DC0) __sfr PWM11OFCON;
__at(0x0DC0) volatile __PWM11OFCONbits_t PWM11OFCONbits;

__at(0x0E0C) __sfr PPSLOCK;
__at(0x0E0C) volatile __PPSLOCKbits_t PPSLOCKbits;

__at(0x0E0D) __sfr INTPPS;

__at(0x0E0E) __sfr T0CKIPPS;

__at(0x0E0F) __sfr T1CKIPPS;

__at(0x0E10) __sfr T1GPPS;

__at(0x0E11) __sfr T3CKIPPS;

__at(0x0E12) __sfr T3GPPS;

__at(0x0E13) __sfr T5CKIPPS;

__at(0x0E14) __sfr T5GPPS;

__at(0x0E15) __sfr T2CKIPPS;

__at(0x0E16) __sfr T4CKIPPS;

__at(0x0E17) __sfr T6CKIPPS;

__at(0x0E18) __sfr T8CKIPPS;

__at(0x0E19) __sfr CCP1PPS;

__at(0x0E1A) __sfr CCP2PPS;

__at(0x0E1B) __sfr CCP7PPS;

__at(0x0E1D) __sfr COG1INPPS;

